/usr/lib64/python2.7/site-packages/h5py/__init__.py:36: FutureWarning: Conversion of the second argument of issubdtype from `float` to `np.floating` is deprecated. In future, it will be treated as `np.float64 == np.dtype(float).type`.
  from ._conv import register_converters as _register_converters
Using TensorFlow backend.
2018-03-27 03:00:29.350104: I tensorflow/core/platform/cpu_feature_guard.cc:137] Your CPU supports instructions that this TensorFlow binary was not compiled to use: SSE4.1 SSE4.2
Train conv_keras from different conv_layer
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv_1 (Conv2D)              (None, 32, 32, 16)        1216      
_________________________________________________________________
pool_1 (MaxPooling2D)        (None, 16, 16, 16)        0         
_________________________________________________________________
zero_padding2d_1 (ZeroPaddin (None, 20, 20, 16)        0         
_________________________________________________________________
conv_2 (Conv2D)              (None, 16, 16, 20)        8020      
_________________________________________________________________
pool_2 (MaxPooling2D)        (None, 8, 8, 20)          0         
_________________________________________________________________
zero_padding2d_2 (ZeroPaddin (None, 12, 12, 20)        0         
_________________________________________________________________
conv_3 (Conv2D)              (None, 8, 8, 20)          10020     
_________________________________________________________________
pool_3 (MaxPooling2D)        (None, 4, 4, 20)          0         
_________________________________________________________________
flat (Flatten)               (None, 320)               0         
_________________________________________________________________
fc_1 (Dense)                 (None, 10)                3210      
=================================================================
Total params: 22,466
Trainable params: 22,466
Non-trainable params: 0
_________________________________________________________________
----- activations -----
(10000, 16, 16, 16)
----- activations -----
(50000, 16, 16, 16)
Train acc
0.0662
Test acc
0.63726
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv_1 (Conv2D)              (None, 32, 32, 16)        1216      
_________________________________________________________________
pool_1 (MaxPooling2D)        (None, 16, 16, 16)        0         
_________________________________________________________________
zero_padding2d_3 (ZeroPaddin (None, 20, 20, 16)        0         
_________________________________________________________________
conv_2 (Conv2D)              (None, 16, 16, 20)        8020      
_________________________________________________________________
pool_2 (MaxPooling2D)        (None, 8, 8, 20)          0         
_________________________________________________________________
zero_padding2d_4 (ZeroPaddin (None, 12, 12, 20)        0         
_________________________________________________________________
conv_3 (Conv2D)              (None, 8, 8, 20)          10020     
_________________________________________________________________
pool_3 (MaxPooling2D)        (None, 4, 4, 20)          0         
_________________________________________________________________
flat (Flatten)               (None, 320)               0         
_________________________________________________________________
fc_1 (Dense)                 (None, 10)                3210      
=================================================================
Total params: 22,466
Trainable params: 22,466
Non-trainable params: 0
_________________________________________________________________
----- activations -----
(10000, 8, 8, 20)
----- activations -----
(50000, 8, 8, 20)
Train acc
0.5657
Test acc
0.72744
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv_1 (Conv2D)              (None, 32, 32, 16)        1216      
_________________________________________________________________
pool_1 (MaxPooling2D)        (None, 16, 16, 16)        0         
_________________________________________________________________
zero_padding2d_5 (ZeroPaddin (None, 20, 20, 16)        0         
_________________________________________________________________
conv_2 (Conv2D)              (None, 16, 16, 20)        8020      
_________________________________________________________________
pool_2 (MaxPooling2D)        (None, 8, 8, 20)          0         
_________________________________________________________________
zero_padding2d_6 (ZeroPaddin (None, 12, 12, 20)        0         
_________________________________________________________________
conv_3 (Conv2D)              (None, 8, 8, 20)          10020     
_________________________________________________________________
pool_3 (MaxPooling2D)        (None, 4, 4, 20)          0         
_________________________________________________________________
flat (Flatten)               (None, 320)               0         
_________________________________________________________________
fc_1 (Dense)                 (None, 10)                3210      
=================================================================
Total params: 22,466
Trainable params: 22,466
Non-trainable params: 0
_________________________________________________________________
----- activations -----
(10000, 4, 4, 20)
----- activations -----
(50000, 4, 4, 20)
Train acc
0.6343
Test acc
0.713
Trian small-alex-net from different conv_layer and fc layers
Data Imported
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv_1 (Conv2D)              (None, 24, 24, 96)        7296      
_________________________________________________________________
pool_1 (MaxPooling2D)        (None, 11, 11, 96)        0         
_________________________________________________________________
norm_1 (BatchNormalization)  (None, 11, 11, 96)        384       
_________________________________________________________________
conv_2 (Conv2D)              (None, 7, 7, 96)          230496    
_________________________________________________________________
pool_2 (MaxPooling2D)        (None, 3, 3, 96)          0         
_________________________________________________________________
norm_2 (BatchNormalization)  (None, 3, 3, 96)          384       
_________________________________________________________________
flatten_1 (Flatten)          (None, 864)               0         
_________________________________________________________________
fc_1 (Dense)                 (None, 384)               332160    
_________________________________________________________________
fc_2 (Dense)                 (None, 192)               73920     
_________________________________________________________________
fc_3 (Dense)                 (None, 10)                1930      
=================================================================
Total params: 646,570
Trainable params: 646,186
Non-trainable params: 384
_________________________________________________________________
----- activations -----
(10000, 11, 11, 96)
----- activations -----
(50000, 11, 11, 96)
Train acc
0.0
Test acc
0.53354
Data Imported
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv_1 (Conv2D)              (None, 24, 24, 96)        7296      
_________________________________________________________________
pool_1 (MaxPooling2D)        (None, 11, 11, 96)        0         
_________________________________________________________________
norm_1 (BatchNormalization)  (None, 11, 11, 96)        384       
_________________________________________________________________
conv_2 (Conv2D)              (None, 7, 7, 96)          230496    
_________________________________________________________________
pool_2 (MaxPooling2D)        (None, 3, 3, 96)          0         
_________________________________________________________________
norm_2 (BatchNormalization)  (None, 3, 3, 96)          384       
_________________________________________________________________
flatten_2 (Flatten)          (None, 864)               0         
_________________________________________________________________
fc_1 (Dense)                 (None, 384)               332160    
_________________________________________________________________
fc_2 (Dense)                 (None, 192)               73920     
_________________________________________________________________
fc_3 (Dense)                 (None, 10)                1930      
=================================================================
Total params: 646,570
Trainable params: 646,186
Non-trainable params: 384
_________________________________________________________________
----- activations -----
(10000, 3, 3, 96)
----- activations -----
(50000, 3, 3, 96)
Train acc
0.3971
Test acc
0.6007
Data Imported
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv_1 (Conv2D)              (None, 24, 24, 96)        7296      
_________________________________________________________________
pool_1 (MaxPooling2D)        (None, 11, 11, 96)        0         
_________________________________________________________________
norm_1 (BatchNormalization)  (None, 11, 11, 96)        384       
_________________________________________________________________
conv_2 (Conv2D)              (None, 7, 7, 96)          230496    
_________________________________________________________________
pool_2 (MaxPooling2D)        (None, 3, 3, 96)          0         
_________________________________________________________________
norm_2 (BatchNormalization)  (None, 3, 3, 96)          384       
_________________________________________________________________
flatten_3 (Flatten)          (None, 864)               0         
_________________________________________________________________
fc_1 (Dense)                 (None, 384)               332160    
_________________________________________________________________
fc_2 (Dense)                 (None, 192)               73920     
_________________________________________________________________
fc_3 (Dense)                 (None, 10)                1930      
=================================================================
Total params: 646,570
Trainable params: 646,186
Non-trainable params: 384
_________________________________________________________________
----- activations -----
(10000, 384)
----- activations -----
(50000, 384)
Train acc
0.4819
Test acc
0.5877
Data Imported
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv_1 (Conv2D)              (None, 24, 24, 96)        7296      
_________________________________________________________________
pool_1 (MaxPooling2D)        (None, 11, 11, 96)        0         
_________________________________________________________________
norm_1 (BatchNormalization)  (None, 11, 11, 96)        384       
_________________________________________________________________
conv_2 (Conv2D)              (None, 7, 7, 96)          230496    
_________________________________________________________________
pool_2 (MaxPooling2D)        (None, 3, 3, 96)          0         
_________________________________________________________________
norm_2 (BatchNormalization)  (None, 3, 3, 96)          384       
_________________________________________________________________
flatten_4 (Flatten)          (None, 864)               0         
_________________________________________________________________
fc_1 (Dense)                 (None, 384)               332160    
_________________________________________________________________
fc_2 (Dense)                 (None, 192)               73920     
_________________________________________________________________
fc_3 (Dense)                 (None, 10)                1930      
=================================================================
Total params: 646,570
Trainable params: 646,186
Non-trainable params: 384
_________________________________________________________________
----- activations -----
(10000, 192)
----- activations -----
(50000, 192)
Train acc
0.5714
Test acc
0.63006
